       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALC-SENIAT.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-I             PIC 9(02) VALUE 1.
       01 WS-FACTOR-IVA    PIC 9V99 VALUE 0.16.
       01 WS-FACTOR-IGTF   PIC 9V99 VALUE 0.03.

       LINKAGE SECTION.
       COPY "FAC-ENCABEZADO.cpy".
       COPY "FAC-RENGLON.cpy".
       COPY "FISCAL-SENIAT.cpy".

       PROCEDURE DIVISION USING FACTURA-CABECERA FAC-DETALLE DATOS-FISCALES-SENIAT.
           MOVE ZERO TO FIS-BASE-IMP-GEN FIS-MONTO-IVA-GEN FIS-BASE-EXENTO FIS-MONTO-IGTF.

           PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 10
              IF REN-COD-PROD(WS-I) NOT = SPACES
                 IF REN-ALICUOTA(WS-I) = "G"
                    ADD REN-TOTAL-LINEA(WS-I) TO FIS-BASE-IMP-GEN
                 ELSE IF REN-ALICUOTA(WS-I) = "E"
                    ADD REN-TOTAL-LINEA(WS-I) TO FIS-BASE-EXENTO
                 END-IF
              END-IF
           END-PERFORM.

           COMPUTE FIS-MONTO-IVA-GEN ROUNDED = FIS-BASE-IMP-GEN * WS-FACTOR-IVA.

           IF FAC-FORMA-PAGO = "DV"
              COMPUTE FIS-MONTO-IGTF ROUNDED = (FIS-BASE-IMP-GEN + FIS-BASE-EXENTO + FIS-MONTO-IVA-GEN) * WS-FACTOR-IGTF
           END-IF.

           COMPUTE FAC-TOTAL-NETO = FIS-BASE-IMP-GEN + FIS-BASE-EXENTO + FIS-MONTO-IVA-GEN + FIS-MONTO-IGTF.
           GOBACK.
