       IDENTIFICATION DIVISION.
       PROGRAM-ID. CORRELATIVO.

       DATA DIVISION.
       LINKAGE SECTION.
       COPY "FAC-ENCABEZADO.cpy".
       COPY "FISCAL-SENIAT.cpy".

       PROCEDURE DIVISION USING FACTURA-CABECERA DATOS-FISCALES-SENIAT.
           MOVE 00000101 TO FAC-NUMERO.
           MOVE 00000101 TO FAC-NUMERO-INTERNO.
           MOVE "00-00000101" TO FIS-NUM-CONTROL.
           GOBACK.
