       IDENTIFICATION DIVISION.
       PROGRAM-ID. VAL-FACTURA.

       DATA DIVISION.
       LINKAGE SECTION.
       COPY "FAC-ENCABEZADO.cpy".
       COPY "FAC-RENGLON.cpy".
       01 LK-STATUS-VAL PIC 9(02).

       PROCEDURE DIVISION USING FACTURA-CABECERA FAC-DETALLE LK-STATUS-VAL.
           IF FAC-COD-CLIENTE = SPACES
              MOVE 01 TO LK-STATUS-VAL
           ELSE
              MOVE 00 TO LK-STATUS-VAL
           END-IF.
           GOBACK.
