       IDENTIFICATION DIVISION.
       PROGRAM-ID. VAL-SENIAT.

       DATA DIVISION.
       LINKAGE SECTION.
       COPY "FISCAL-SENIAT.cpy".
       01 LK-STATUS-SENIAT PIC 9(02).

       PROCEDURE DIVISION USING DATOS-FISCALES-SENIAT LK-STATUS-SENIAT.
           IF FIS-RIF-CLIENTE = SPACES
              MOVE 02 TO LK-STATUS-SENIAT
           ELSE
              MOVE 00 TO LK-STATUS-SENIAT
           END-IF.
           GOBACK.
