       01 CAJERO-INFO.
          05 CAJ-CAJA           PIC X(05).
          05 CAJ-CODIGO         PIC X(10).
          05 CAJ-NOMBRE         PIC X(40).
