       01 EMPRESA-SUCURSAL.
           05 EMP-CODIGO         PIC X(10).
           05 EMP-NOMBRE         PIC X(60).
           05 EMP-RIF            PIC X(12).
           05 EMP-DIRECCION      PIC X(80).
           05 EMP-CIUDAD         PIC X(40).
           05 EMP-ESTADO         PIC X(40).
           05 EMP-ZONA-POSTAL    PIC X(10).