       01 FACTURA-CABECERA.
          05 FAC-NUMERO          PIC 9(08) VALUE ZERO.
          05 FAC-NUMERO-INTERNO  PIC 9(08) VALUE ZERO.
          05 FAC-COD-CLIENTE     PIC X(10).
          05 FAC-FECHA-EMISION   PIC 9(08).
          05 FAC-FORMA-PAGO      PIC X(02).
          05 FAC-MONTO-BRUTO     PIC 9(09)V99 VALUE ZERO.
          05 FAC-MONTO-DESCUENTO PIC 9(07)V99 VALUE ZERO.
          05 FAC-TOTAL-NETO      PIC 9(09)V99 VALUE ZERO.
          05 FAC-CANT-ITEMS      PIC 9(03) VALUE ZERO.
