       01 FAC-DETALLE.
          05 REN-ITEM OCCURS 10 TIMES.
             10 REN-COD-PROD     PIC X(10).
             10 REN-CANTIDAD     PIC 9(05).
             10 REN-PRECIO-UNIT  PIC 9(07)V99.
             10 REN-ALICUOTA     PIC X(01).
             10 REN-TOTAL-LINEA  PIC 9(09)V99.
