       01 DATOS-FISCALES-SENIAT.
          05 FIS-RIF-CLIENTE     PIC X(12).
          05 FIS-RAZON-SOCIAL    PIC X(40).
          05 FIS-NUM-CONTROL     PIC X(12).
          05 FIS-BASE-IMP-GEN    PIC 9(09)V99 VALUE ZERO.
          05 FIS-MONTO-IVA-GEN   PIC 9(09)V99 VALUE ZERO.
          05 FIS-BASE-EXENTO     PIC 9(09)V99 VALUE ZERO.
          05 FIS-MONTO-IGTF      PIC 9(09)V99 VALUE ZERO.
