       01 DATOS-PAGO.
           05 PAG-FORMA-PAGO     PIC X(02).
           05 PAG-MONTO-PAGADO   PIC 9(09)V99.
           05 PAG-VUELTO         PIC 9(09)V99.