       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALC-FACTURA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-I PIC 9(02) VALUE 1.

       LINKAGE SECTION.
       COPY "FAC-ENCABEZADO.cpy".
       COPY "FAC-RENGLON.cpy".

       PROCEDURE DIVISION USING FACTURA-CABECERA FAC-DETALLE.
           MOVE ZERO TO FAC-MONTO-BRUTO.
           PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 10
              IF REN-COD-PROD(WS-I) NOT = SPACES
                 COMPUTE REN-TOTAL-LINEA(WS-I) = REN-CANTIDAD(WS-I) * REN-PRECIO-UNIT(WS-I)
                 ADD REN-TOTAL-LINEA(WS-I) TO FAC-MONTO-BRUTO
              END-IF
           END-PERFORM.
           GOBACK.
