       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB-FAC-ENC.

       DATA DIVISION.
       LINKAGE SECTION.
       COPY "FAC-ENCABEZADO.cpy".
       COPY "FISCAL-SENIAT.cpy".

       PROCEDURE DIVISION USING FACTURA-CABECERA DATOS-FISCALES-SENIAT.
           DISPLAY "[DB-MOCK] Encabezado guardado Factura Nro: " FAC-NUMERO.
           GOBACK.
