       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROC-FACTURA.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-STATUS-VAL     PIC 9(02) VALUE ZERO.
       01 WS-STATUS-SENIAT  PIC 9(02) VALUE ZERO.

       LINKAGE SECTION.
       COPY "FAC-ENCABEZADO.cpy".
       COPY "FAC-RENGLON.cpy".
       COPY "FISCAL-SENIAT.cpy".
       01 LK-RESPUESTA      PIC 9(02).

       PROCEDURE DIVISION USING FACTURA-CABECERA 
                                FAC-DETALLE 
                                DATOS-FISCALES-SENIAT 
                                LK-RESPUESTA.

       0000-MAIN.
           CALL "VAL-FACTURA" USING FACTURA-CABECERA FAC-DETALLE WS-STATUS-VAL.
           IF WS-STATUS-VAL NOT = 0
              MOVE WS-STATUS-VAL TO LK-RESPUESTA
              GOBACK
           END-IF.

           CALL "VAL-SENIAT" USING DATOS-FISCALES-SENIAT WS-STATUS-SENIAT.
           IF WS-STATUS-SENIAT NOT = 0
              MOVE WS-STATUS-SENIAT TO LK-RESPUESTA
              GOBACK
           END-IF.

           CALL "CALC-FACTURA" USING FACTURA-CABECERA FAC-DETALLE.
           CALL "CALC-SENIAT" USING FACTURA-CABECERA FAC-DETALLE DATOS-FISCALES-SENIAT.
           CALL "CORRELATIVO" USING FACTURA-CABECERA DATOS-FISCALES-SENIAT.

           CALL "DB-FAC-ENC" USING FACTURA-CABECERA DATOS-FISCALES-SENIAT.
           CALL "DB-FAC-REN" USING FAC-DETALLE.
           CALL "DB-INVENTARIO" USING FAC-DETALLE.
           CALL "DB-CORRELATIVO".

           MOVE 00 TO LK-RESPUESTA.
           GOBACK.
