       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB-CORRELATIVO.

       PROCEDURE DIVISION.
           DISPLAY "[DB-MOCK] Correlativos actualizados en BD.".
           GOBACK.
